Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Although TLS PSKs can be established out of band, PSKs can also be established in a previous connection and then used to establish a new connection ("session resumption" or "resuming" with a PSK).
zh_cn: 虽然可以在带外建立 TLS PSK，但也可以在先前的连接中建立 PSK，然后用于建立新连接(“会话恢复”或“恢复”用 PSK)。

source: Although any token character MAY appear in a product-version, this token SHOULD only be used for a version identifier (i.e., successive versions of the same product SHOULD only differ in the product-version portion of the product value).
zh_cn: 虽然任何标记字符可能出现在产品版本中，但此标记应该仅用于版本标识符(即，同一产品的连续版本应该只在产品值的产品版本部分中有所不同)。

source: Although each response header field has a defined meaning, in general, the precise semantics might be further refined by the semantics of the request method and/or response status code.
zh_cn: 尽管每个响应首部字段具有定义的含义，但是通常，精确的语义可以通过请求方法和/或响应状态代码的语义进一步细化。

source: Although host is case-insensitive, producers and normalizers should use lowercase for registered names and hexadecimal addresses for the sake of uniformity, while only using uppercase letters for percent-encodings.
zh_cn: 尽管 host 不区分大小写，但为了统一性，生产者和规范化器应使用小写的注册名称和十六进制地址，而只使用大写字母表示百分比编码。

source: Although it resembles the programming language "C" in its syntax and XDR [XDR] in both its syntax and intent, it would be risky to draw too many parallels.
zh_cn: 尽管它在语法上与编程语言“C”相似，在语法和意图上与 XDR[XDR] 相似，但是绘制太多的相似之处会有风险。

source: Although no practical attacks against this construction are known, Klima et al.
zh_cn: 虽然没有人知道对这种结构的实际攻击，但 Klima 等人

source: Although schemes are case-insensitive, the canonical form is lowercase and documents that specify schemes must do so with lowercase letters.
zh_cn: 虽然方案不区分大小写，但规范形式是小写的，指定方案的文档必须使用小写字母。

source: Although the `Flowable` infrastructure guarantees it will be called at most once on each `Subscriber`, the call to `request(1)` may trigger the emission of an element right away.
zh_cn: 虽然 `Flowable` 基础设施保证在每个 `Subscriber` 上最多只调用一次，但是对 `request(1)` 的调用可能会立即触发一个元素的发射。

source: Although the diagram is linear, each participant may be engaged in multiple, simultaneous communications.
zh_cn: 尽管该图是线性的，但每个参与者可以参与多个同时通信。

source: Although the diagram is linear, each participant might be engaged in multiple, simultaneous communications.
zh_cn: 尽管该图是线性的，但每个参与者可能参与多个同时通信。

source: Although the line terminator for the start-line and header fields is the sequence CRLF, a recipient MAY recognize a single LF as a line terminator and ignore any preceding CR.
zh_cn: 尽管起始行和首部字段的行终止符是序列 CRLF，但是接收者可以将单个 LF 识别为行终止符并忽略任何前面的 CR。

source: Although the request-line and status-line grammar rules require that each of the component elements be separated by a single SP octet, recipients MAY instead parse on whitespace-delimited word boundaries and, aside from the CRLF terminator, treat any form of whitespace as the SP separator while ignoring preceding or trailing whitespace; such whitespace includes one or more of the following octets: SP, HTAB, VT (%x0B), FF (%x0C), or bare CR.
zh_cn: 虽然请求行和状态行语法规则要求每个组件元素由单个 SP 八位字节分隔，但是接收者可以改为解析以空格分隔的字边界，并且除了 CRLF 终止符之外，将任何形式的空格视为 SP 分隔符，同时忽略前面或后面的空格；这样的空白包括以下八位字节中的一个或多个：SP，HTAB，VT (%x0B)，FF (%x0C)或裸 CR。

source: Although the use of the Common Name is existing practice, it is deprecated and Certification Authorities are encouraged to use the dNSName instead.
zh_cn: 尽管使用 Common Name 是现有做法，但不推荐使用它，并且鼓励证书颁发机构使用 dNSName。

source: Although the value describes the content-coding, what is more important is that it indicates what decoding mechanism will be required to remove the encoding.
zh_cn: 虽然该值描述了内容编码，但更重要的是它指示了移除编码所需的解码机制。

source: Although there is much overlap between implementations, there are also some operators that are only implemented in certain implementations.
zh_cn: 虽然实现之间存在很多重叠，但也有一些操作符仅在某些实现中实现。

source: Although there is no standard set of heuristics for disambiguating a URI suffix, many client implementations allow them to be entered by the user and heuristically resolved.
zh_cn: 虽然没有标准的启发式方法来消除 URI 后缀的歧义，但许多客户端实现允许用户输入并启发式解析。

source: Although these examples do not show connection synchronization using data-carrying segments, this is perfectly legitimate, so long as the receiving TCP doesn't deliver the data to the user until it is clear the data is valid (i.e., the data must be buffered at the receiver until the connection reaches the ESTABLISHED state).
zh_cn: 虽然这些示例没有显示使用数据承载报文段的连接同步，但这是完全合法的，只要接收 TCP 不向用户传递数据，直到数据有效（即数据必须在接收器处被缓冲，直到连接达到 ESTABLISHED 状态）。

source: Although this practice of using suffix references is common, it should be avoided whenever possible and should never be used in situations where long-term references are expected.
zh_cn: 尽管这种使用后缀引用的做法很常见，但应尽可能避免使用后缀，并且绝不应在需要长期引用的情况下使用。

source: Although this separate handling is often perceived to be a loss of information, particularly for accurate redirection of references as resources move over time, it also serves to prevent information providers from denying reference authors the right to refer to information within a resource selectively.
zh_cn: 虽然这种单独处理通常被认为是信息丢失，特别是随着资源随时间推移而对参考文献进行精确重定向，但它也有助于防止信息提供者拒绝参考作者有选择地引用资源内的信息。

source: Although this set can be expanded, additional methods cannot be assumed to share the same semantics for separately extended clients and servers.
zh_cn: 虽然可以扩展此集合，但不能假定其他方法为单独扩展的客户端和服务器共享相同的语义。

source: Although this specification does not define any use for such a body, future extensions to HTTP might use the OPTIONS body to make more detailed queries on the server.
zh_cn: 尽管此规范未定义此类主体的任何用途，但 HTTP 的未来扩展可能使用 OPTIONS 主体在服务器上进行更详细的查询。

source: Although this specification does not define any use for such a payload, future extensions to HTTP might use the OPTIONS body to make more detailed queries about the target resource.
zh_cn: 尽管此规范未定义此类有效载荷的任何用途，但 HTTP 的未来扩展可能会使用 OPTIONS 主体对目标资源进行更详细的查询。

source: Among the variables stored in the TCB are the local and remote socket numbers, the security and precedence of the connection, pointers to the user's send and receive buffers, pointers to the retransmit queue and to the current segment.
zh_cn: 存储在 TCB 中的变量包括本地和远程套接字号，连接的安全性和优先级，指向用户的发送和接收缓冲区的指针，指向重新传输队列和当前报文段的指针。

source: An "XXX" indicates a segment which is lost or rejected.
zh_cn: “XXX”表示丢失或拒绝的报文段。

source: An "absolute-path" rule is defined for protocol elements that can contain a non-empty path component.
zh_cn: 为可以包含非空路径组件的协议元素定义“absolute-path”规则。

source: An AsyncSubject emits the last value (and only the last value) emitted by the source Observable, and only after that source Observable completes.
zh_cn: AsyncSubject 发射源 Observable 发射的最后一个值(且仅发射最后一个值)，并且只在该 Observable 源完成后才会发射。

source: An AEAD algorithm used in TLS 1.3 MUST NOT produce an expansion greater than 255 octets.
zh_cn: TLS 1.3 中使用的 AEAD 算法不得产生大于 255 个八位字节的扩展。

source: An Alphabetical List of Observable Operators
zh_cn: 按字母顺序排列的 Observable 操作符

source: An HTTP "client" is a program that establishes a connection to a server for the purpose of sending one or more HTTP requests.
zh_cn: HTTP“客户端 (client)”是为了发送一个或多个 HTTP 请求而建立与服务器的连接的程序。

source: An HTTP "server" is a program that accepts connections in order to service HTTP requests by sending HTTP responses.
zh_cn: HTTP“服务器 (server)”是接受连接以通过发送 HTTP 响应来服务 HTTP 请求的程序。

source: An HTTP message can be either a request from client to server or a response from server to client.
zh_cn: HTTP 消息可以是从客户端到服务器的请求，也可以是从服务器到客户端的响应。

source: An HTTP message can be parsed as a stream for incremental processing or forwarding downstream.
zh_cn: 可以将 HTTP 消息解析为用于增量处理或向下游转发的流。

source: An HTTP request message, as defined in section 5.
zh_cn: HTTP 请求消息，如第 5 节中所定义。

source: An HTTP response message, as defined in section 6.
zh_cn: HTTP 响应消息，如第 6 节中所定义。

source: An HTTP service based on some other underlying connection protocol would presumably be identified using a different URI scheme, just as the "https" scheme (below) is used for resources that require an end-to-end secured connection.
zh_cn: 基于某些其他基础连接协议的 HTTP 服务可能会使用不同的 URI 方案进行标识，就像“https”方案(下面)用于需要端到端安全连接的资源一样。

source: An HTTP/1.1 (or later) client sending a message-body SHOULD monitor the network connection for an error status while it is transmitting the request.
zh_cn: 发送消息主体的 HTTP/1.1(或更高版本)客户端应该在发送请求时监视网络连接的错误状态。

source: An HTTP/1.1 client MAY expect a connection to remain open, but would decide to keep it open based on whether the response from a server contains a Connection header with the connection-token close.
zh_cn: HTTP/1.1 客户端可能希望连接保持打开状态，但会根据服务器的响应是否包含连接标记关闭的 Connection 首部来决定是否保持打开状态。

source: An HTTP/1.1 server MAY assume that a HTTP/1.1 client intends to maintain a persistent connection unless a Connection header including the connection-token "close" was sent in the request.
zh_cn: HTTP/1.1 服务器可以假设 HTTP/1.1 客户端打算维持持久连接，除非在请求中发送包含连接标记“close”的 Connection 首部。

source: An HTTP/1.1 user agent MUST NOT preface or follow a request with an extra CRLF.
zh_cn: HTTP/1.1 用户代理不能在请求前面或后面附加一个 CRLF。

source: An OPTIONS request with an asterisk ("*") as the request-target (Section 5.3 of [RFC7230]) applies to the server in general rather than to a specific resource.
zh_cn: 带有星号(“*”)作为请求目标的 OPTIONS 请求([RFC7230] 的第 5.3 节)通常适用于服务器而不是特定资源。

source: An Observable emits items or sends notifications to its observers by calling the observers’ methods.
zh_cn: Observable(可观察对象) emits (发射) items (数据项) 或通过调用观察者的方法向其观察者发送 notifications (通知)。

source: An Observable calls this method after it has called onNext for the final time, if it has not encountered any errors.
zh_cn: 如果 Observable 没有遇到任何错误，则在最后一次调用 onNext 之后调用此方法。

source: An Observable calls this method to indicate that it has failed to generate the expected data or has encountered some other error.
zh_cn: Observable 调用此方法以指示它无法生成预期数据或遇到其他一些错误。

source: An Observable calls this method whenever the Observable emits an item.
zh_cn: 只要 Observable 发射一个项目，Observable 就会调用此方法。

source: An Observable has all of the flexibility and elegance associated with its mirror-image cousin the Iterable.
zh_cn: Observable 具有与 Iterable 镜像相关的所有灵活性和优雅。

source: An Observable is the asynchronous/push “dual” to the synchronous/pull Iterable
zh_cn: Observable 是异步的双向(“dual”) push，Iterable 是同步的 pull

source: An additional sparse data type is available called enum.
zh_cn: 另一种稀疏数据类型称为枚举。

source: An additional sparse data type, called "enum" or "enumerated", is available.
zh_cn: 可以使用称为“enum”或“enumerated”的其他稀疏数据类型。

source: An advantage of this approach is that when you have a bunch of tasks that are not dependent on each other, you can start them all at the same time rather than waiting for each one to finish before starting the next one — that way, your entire bundle of tasks only takes as long to complete as the longest task in the bundle.
zh_cn: 这种方法的一个优点是，当您有一堆不依赖于彼此的任务时，你可以同时启动所有任务，而不是等到每个任务完成后再开始下一个 - 这样，你的整个捆绑任务只会耗费与捆绑中最长的任务一样长的时间。

source: An algorithm to be used for bulk encryption.
zh_cn: 一种用于批量加密的算法。

source: An algorithm to be used for data compression.
zh_cn: 一种用于数据压缩的算法。

source: An algorithm to be used for message authentication.
zh_cn: 一种用于消息验证的算法。

source: An algorithm used to generate keys from the master secret (see Sections 5 and 6.3).
zh_cn: 用于从主密钥生成密钥的算法(参见第 5 节和第 6.3 节)。

source: An alternative approach is to treat a version number mismatch as a PKCS-1 formatting error and randomize the premaster secret completely:
zh_cn: 另一种方法是将版本号不匹配视为 PKCS-1 格式错误，并完全随机化预主密钥：

source: An application program that accepts connections in order to service requests by sending back responses.
zh_cn: 一种应用程序，它接受连接以通过发回响应来为请求提供服务。

source: An application that sends a request or response message that includes HTTP-Version of "HTTP/1.1" MUST be at least conditionally compliant with this specification.
zh_cn: 发送包含 HTTP-Version 为 “HTTP/1.1”的请求或响应消息的应用程序必须至少有条件地符合此规范。

source: An arbitrary byte sequence chosen by the server to identify an active or resumable session state.
zh_cn: 服务器选择的任意字节序列，用于标识活动或可恢复的会话状态。

source: An encoding format produced by the file compression program "gzip" (GNU zip) as described in RFC 1952 [25].
zh_cn: 由 RFC 1952 [25] 中描述的文件压缩程序“gzip”(GNU zip)生成的编码格式。

source: An endpoint that receives a record from its peer with TLSCiphertext.length larger than 2^14 + 256 octets MUST terminate the connection with a "record_overflow" alert.
zh_cn: 从 TLSCiphertext.length 大于 2 ^ 14 + 256 个八位字节的对等端接收记录的端点必须以“record_overflow”警报终止连接。

source: An endpoint that receives a record that exceeds this length MUST terminate the connection with a "record_overflow" alert.
zh_cn: 接收超过此长度的记录的端点必须使用“record_overflow”警报终止连接。

source: An entity can be broken down into subranges according to various structural units.
zh_cn: 可以根据各种结构单元将实体分解为子范围。

source: An entity consists of entity-header fields and an entity-body, although some responses will only include the entity-headers.
zh_cn: 实体由实体首部字段和实体主体组成，但有些响应仅包含实体首部。

source: An entity consists of metainformation in the form of entity-header fields and content in the form of an entity-body, as described in section 7.
zh_cn: 实体由实体首部字段形式的元信息和实体主体形式的内容组成，如第 7 节所述。

source: An entity included with a response that is subject to content negotiation, as described in section 12.
zh_cn: 如第 12 节所述，包含在内容协商中的响应的实体。

source: An entity tag MUST be unique across all versions of all entities associated with a particular resource.
zh_cn: 实体标签必须在与特定资源相关联的所有实体的所有版本中都是唯一的。

source: An entity tag consists of an opaque quoted string, possibly prefixed by a weakness indicator.
zh_cn: 实体标签由不透明的带引号的字符串组成，可能以弱指示符为前缀。

source: An entity-body is only present in a message when a message-body is present, as described in section 4.3.
zh_cn: 如第 4.3 节所述，实体实体仅在存在消息体时出现在消息中。

source: An entity-body transferred via HTTP messages MUST be represented in the appropriate canonical form prior to its transmission except for "text" types, as defined in the next paragraph.
zh_cn: 通过 HTTP 消息传输的实体-主体必须在传输之前以适当的规范形式表示，除了“文本”类型，如下一段中所定义。

source: An enumerated occupies as much space in the byte stream as would its maximal defined ordinal value.
zh_cn: 枚举在字节流中占用的空间与其定义的最大序数值占用的空间一样多。

source: An established connection is said to be "half-open" if one of the TCPs has closed or aborted the connection at its end without the knowledge of the other, or if the two ends of the connection have become desynchronized owing to a crash that resulted in loss of memory.
zh_cn: 如果其中一个 TCP 在其不知道另一个的情况下关闭或中止了连接，或者如果连接的两端由于崩溃而变得不同步导致失去记忆，则建立的连接被称为“半开”。

source: An example Request-Line would be:
zh_cn: Request-Line 示例如下：

source: An example URI specifying HTTP/TLS is:
zh_cn: 指定 HTTP/TLS 的示例 URI 是：

source: An example absolute-form of request-line would be:
zh_cn: 请求行的绝对形式示例如下：

source: An example is
zh_cn: 一个例子是

source: An example of an enhancement that would classify as this is adding reactive pull backpressure support to an operator that previously did not support it.
zh_cn: 可归类为此增强功能的一个示例是向先前不支持它的运算符添加反应性拉背压支持。

source: An example process for decoding a Chunked-Body is presented in appendix 19.4.6.
zh_cn: 解码 Chunked-Body 的示例过程在附录 19.4.6 中给出。

source: An expiration time assigned by a cache when no explicit expiration time is available.
zh_cn: 当没有明确的到期时间可用时由缓存分配的到期时间。

source: An extension type MUST NOT appear in the ServerHello unless the same extension type appeared in the corresponding ClientHello.
zh_cn: 除非在相应的 ClientHello 中出现相同的扩展类型，否则扩展类型不得出现在 ServerHello 中。

source: An idempotent sequence of requests is no longer required to be retried.
zh_cn: 不再需要重试幂等序列的请求。

source: An identifier embodies the information required to distinguish what is being identified from all other things within its scope of identification.
zh_cn: 标识符包含在其识别范围内区分所识别的内容与所有其他内容所需的信息。

source: An identifier is an object that can act as a reference to something that has identity.
zh_cn: 标识符是一个对象，可以作为对具有标识的内容的引用。

source: An implementation is considered conformant if it complies with all of the requirements associated with the roles it partakes in HTTP.
zh_cn: 如果实现符合与其在 HTTP 中共享的角色相关的所有要求，则认为该实现符合要求。

source: An implementation is not compliant if it fails to satisfy one or more of the MUST or REQUIRED level requirements for the protocols it implements.
zh_cn: 如果实现无法满足其实现的协议的一个或多个 MUST 或 REQUIRED 级别要求，则该实现不符合要求。

source: An implementation may receive an unencrypted record of type change_cipher_spec consisting of the single byte value 0x01 at any time after the first ClientHello message has been sent or received and before the peer's Finished message has been received and MUST simply drop it without further processing.
zh_cn: 实现可以在发送或接收第一个 ClientHello 消息之后以及在接收到对等端的 Finished 消息之前的任何时间接收由单字节值 0x01 组成的未加密类型的 change_cipher_spec 记录，并且必须简单地删除它而不进行进一步处理。

source: An implementation should accept uppercase letters as equivalent to lowercase in scheme names (e.g., allow "HTTP" as well as "http") for the sake of robustness but should only produce lowercase scheme names for consistency.
zh_cn: 实现应该接受大写字母等同于方案名称中的小写(例如，允许“HTTP”以及“http”)以保持健壮性，但是应该仅为了一致性而产生小写方案名称。

source: An implementation that satisfies all the MUST or REQUIRED level and all the SHOULD level requirements for its protocols is said to be "unconditionally compliant"; one that satisfies all the MUST level requirements but not all the SHOULD level requirements for its protocols is said to be "conditionally compliant."
zh_cn: 满足所有 MUST 或 REQUIRED 级别以及所有 SHOULD 级别要求的协议的实现被称为“无条件兼容”;一个满足所有 MUST 级别要求但不满足其协议的所有 SHOULD 级别要求被称为“有条件兼容”。

source: An implementation which receives any other change_cipher_spec value or which receives a protected change_cipher_spec record MUST abort the handshake with an "unexpected_message" alert.
zh_cn: 接收任何其他 change_cipher_spec 值或接收受保护的 change_cipher_spec 记录的实现必须使用“unexpected_message”警报中止握手。

source: An important change regarding `Subject`s (and by extension, `FlowableProcessor`) that they no longer support `T -> R` like conversion (that is, input is of type `T` and the output is of type `R`).
zh_cn: 关于 `Subject` (以及扩展名 `FlowableProcessor`)的一个重要变化是它们不再支持类似 `T -> R` 的转换(即输入类型为 `T` 且输出类型为 `R` )。

source: An inappropriate message was received.
zh_cn: 收到了不适当的消息。

source: An individual scheme does not have to be classified as being just one of "name" or "locator".
zh_cn: 一个单独的方案不必被归类为“名称”或“定位器”中的一个。

source: An interception proxy is particularly vulnerable if it relies on the Host field-value for redirecting requests to internal servers, or for use as a cache key in a shared cache, without first verifying that the intercepted connection is targeting a valid IP address for that host.
zh_cn: 如果拦截代理依赖 Host 字段值将请求重定向到内部服务器，或者用作共享缓存中的缓存密钥，而不首先验证截获的连接是否针对该主机的有效 IP 地址，则拦截代理特别容易受到攻击。

source: An interesting alternative case occurs when TCP A crashes and TCP B tries to send data on what it thinks is a synchronized connection.
zh_cn: 当 TCP A 崩溃并且 TCP B 尝试发送它认为是同步连接的数据时，会出现一个有趣的替代情况。

source: An intermediary MUST NOT forward a message to itself unless it is protected from an infinite request loop.
zh_cn: 中介绝不能将消息转发给自己，除非它受到无限请求循环的保护。

source: An intermediary not acting as a tunnel MUST implement the Connection header field, as specified in Section 6.1, and exclude fields from being forwarded that are only intended for the incoming connection.
zh_cn: 不充当隧道的中介必须实现 Connection 首部字段，如第 6.1 节所述，并排除转发中仅用于传入连接的字段。

source: An intermediary program which acts as both a server and a client for the purpose of making requests on behalf of other clients.
zh_cn: 中间程序，作为服务器和客户端，代表其他客户端发出请求。

source: An intermediary program which is acting as a blind relay between two connections.
zh_cn: 中间程序，充当两个连接之间的盲中继。

source: An intermediary that receives pipelined requests MAY pipeline those requests when forwarding them inbound, since it can rely on the outbound user agent(s) to determine what requests can be safely pipelined.
zh_cn: 接收流水线请求的中介可以在转发它们时对这些请求进行流水线处理，因为它可以依赖出站用户代理来确定哪些请求可以安全地流水线化。

source: An internal error unrelated to the peer or the correctness of the protocol (such as a memory allocation failure) makes it impossible to continue.
zh_cn: 与对等端无关的内部错误或协议的正确性(例如内存分配失败)使得无法继续。

source: An old duplicate arriving at TCP B (line 2) stirs B into action.
zh_cn: 到达 TCP B(第 2 行)的旧副本激起 B 采取行动。

source: An option may begin on any octet boundary.
zh_cn: 选项可以从任何八位字节边界开始。

source: An origin server SHOULD return the status code 405 (Method Not Allowed) if the method is known by the origin server but not allowed for the requested resource, and 501 (Not Implemented) if the method is unrecognized or not implemented by the origin server.
zh_cn: 如果原始服务器已知该方法但对所请求的资源不允许，则原始服务器应该返回状态代码 405(方法不允许)，如果原始服务器无法识别或未实现该方法，则应返回 501(未实现)。

source: An origin server indicates response semantics by choosing an appropriate status code depending on the result of processing the POST request; almost all of the status codes defined by this specification might be received in a response to POST (the exceptions being 206 (Partial Content), 304 (Not Modified), and 416 (Range Not Satisfiable)).
zh_cn: 源服务器通过根据处理 POST 请求的结果选择适当的状态代码来指示响应语义；几乎所有由本规范定义的状态代码都可能在对 POST 的响应中被接收(异常为 206(部分内容)，304(未修改)和 416(范围不可满足))。

source: An origin server might be provided with, or be capable of generating, multiple representations that are each intended to reflect the current state of a target resource.
zh_cn: 源服务器可以被提供或能够生成多个表示，每个表示旨在反映目标资源的当前状态。

source: An origin server that does differentiate resources based on the host requested (sometimes referred to as virtual hosts or vanity host names) MUST use the following rules for determining the requested resource on an HTTP/1.1 request:
zh_cn: 根据请求的主机(有时称为虚拟主机或 vanity host names)区分资源的源服务器必须使用以下规则来确定 HTTP/1.1 请求上的请求资源：

source: An origin server that does not allow resources to differ by the requested host MAY ignore the Host header field value when determining the resource identified by an HTTP/1.1 request.
zh_cn: 在确定由 HTTP/1.1 请求标识的资源时，不允许与所请求主机的资源不同的源服务器可以忽略 Host 首部字段值。

source: An origin server that receives a CONNECT request for itself MAY respond with a 2xx (Successful) status code to indicate that a connection is established.
zh_cn: 接收自身 CONNECT 请求的源服务器可以使用 2xx(成功)状态代码进行响应，以指示建立了连接。

source: Analysis of these performance problems and results from a prototype implementation are available [26] [30].
zh_cn: 可以获得这些性能问题的分析和原型实现的结果 [26] [30]。

source: And importantly: with ReactiveX you can later change your mind, and radically change the underlying nature of your Observable implementation, without breaking the consumers of your Observable.
zh_cn: 而且重要的是：使用 ReactiveX，你可以改变你的观念，你可从根本上改变 Observable 的底层实现，而不会破坏 Observable 的使用者。

source: Angle brackets are used within definitions whenever their presence will facilitate discerning the use of rule names.
zh_cn: 角度括号在定义中使用，只要它们的存在有助于辨别规则名称的使用。

source: Another significant difference between `rx.Subscriber` (and co) and `org.reactivestreams.Subscriber` (and co) is that in 2.x, your `Subscriber`s and `Observer`s are not allowed to throw anything but fatal exceptions (see `Exceptions.throwIfFatal()`).
zh_cn: `rx.Subscriber`(及 co) 和 `org.reactivestreams.Subscriber`(及 co)之间的另一个显着区别是在 2.x 中，您的 `Subscriber`s 和 `Observer`s 不允许抛出任何异常，除了致命的异常(参见 `Exceptions.throwIfFatal()`)。

source: Another version takes two or more Singles and merges them into an Observable that emits the items emitted by the source Singles (in an arbitrary order):
zh_cn: 另一个版本需要两个或更多 Singles 并将它们合并到一个 Observable 中，该 Observable 发射源 Singles 发射的项目(以任意顺序)：

source: Any 2xx (Successful) response indicates that the sender (and all inbound proxies) will switch to tunnel mode immediately after the blank line that concludes the successful response's header section; data received after that blank line is from the server identified by the request-target.
zh_cn: 任何 2xx(成功)响应都表示发送方(以及所有入站代理)将在结束成功响应的首部部分的空行后立即切换到隧道模式；该空行之后收到的数据来自请求目标标识的服务器。

source: Any 2xx (Successful) response to a CONNECT request implies that the connection will become a tunnel immediately after the empty line that concludes the header fields.
zh_cn: 对 CONNECT 请求的任何 2xx(成功)响应意味着连接将在结束首部字段的空行之后立即成为隧道。
